<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'Δράσεις Επιλογής',
        'bulk_delete' => 'Διαγραφή',
        'cancel' => 'Ακύρωση',
        'delete' => 'Διαγραφή',
        'detach' => 'Αποσύνδεση',
        'deselect' => 'Αποεπιλογή',
        'upload' => 'Μεταφόρτωση',
        'save' => 'Αποθήκευση',
        'select' => 'Επιλογή',
        'add_existing' => 'Προσθήκη Υπάρχοντος',
        'next' => 'Επόμενο',
        'previous' => 'Προηγούμενο',
        'crop' => 'Περικοπή',
        'flip_horizontal' => 'Οριζόντια Αναστροφή',
        'flip_vertical' => 'Κάθετη Αναστροφή',
        'rotate_left' => 'Περιστροφή Αριστερά',
        'rotate_right' => 'Περιστροφή Δεξιά',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'Δίσκος Αποθήκευσης',
            'images' => 'Εικόνα(ες)',
            'alt_text' => 'Εναλλακτικό Κείμενο',
            'file_name' => 'Όνομα Αρχείου',
            'search' => 'Αναζήτηση',
            'width' => 'Πλάτος',
            'height' => 'Ύψος',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Περιστροφή',
        ],
        'helper_texts' => [
            'alt_text' => 'Περιγραφή του τι εμφανίζεται στην εικόνα για βελτιωμένη προσβασιμότητα και SEO.',
        ],
        'placeholders' => [
            'no_image_selected' => 'Δεν έχει επιλεγεί εικόνα.',
            'no_images_selected' => 'Δεν έχουν επιλεγεί εικόνες.',
            'no_images_found' => 'Δεν βρέθηκαν εικόνες.',
            'search' => 'Αναζήτηση με όνομα αρχείου ή εναλλακτικό κείμενο...',
        ],
        'prefixes' => [
            'width' => 'Πλάτος',
            'height' => 'Ύψος',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Περιστροφή',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => '°',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} Διαγραφή :count Εικόνας;|[2,*] Διαγραφή :count Εικόνων;',
            'delete' => 'Διαγραφή Εικόνας',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} Είστε βέβαιοι ότι θέλετε να διαγράψετε την επιλεγμένη εικόνα;|[2,*] Είστε βέβαιοι ότι θέλετε να διαγράψετε τις :count επιλεγμένες εικόνες;',
            'delete' => 'Είστε βέβαιοι ότι θέλετε να διαγράψετε αυτήν την εικόνα;',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'Η εικόνα διαγράφηκε επιτυχώς.',
            'failure' => 'Αποτυχία διαγραφής εικόνας.',
        ],
        'upload' => [
            'success' => '{1} Η εικόνα μεταφορτώθηκε επιτυχώς.|[2,*] Οι εικόνες μεταφορτώθηκαν επιτυχώς.',
            'failure' => '{1} Αποτυχία μεταφόρτωσης της παρεχόμενης εικόνας.|[2,*] Αποτυχία μεταφόρτωσης των παρεχόμενων εικόνων.',
        ],
        'edit_source_image' => [
            'success' => 'Η πηγαία εικόνα ενημερώθηκε επιτυχώς.',
            'failure' => 'Αποτυχία ενημέρωσης πηγαίας εικόνας.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'Δεν βρέθηκαν εικόνες',
        ],
        'title' => 'Βιβλιοθήκη Εικόνων',
    ],
    'tooltips' => [
        'crop' => 'Περικοπή',
        'deselect' => 'Αποεπιλογή',
        'edit' => 'Επεξεργασία',
        'delete' => 'Διαγραφή',
        'detach' => 'Αποσύνδεση',
        'select' => 'Επιλογή',
        'drag_handle' => 'Σύρετε για αναδιάταξη',
        'rotate_right' => 'Περιστροφή Δεξιά',
        'rotate_left' => 'Περιστροφή Αριστερά',
        'flip_horizontal' => 'Οριζόντια Αναστροφή',
        'flip_vertical' => 'Κάθετη Αναστροφή',
        'view' => 'Προβολή',
    ],
];
