<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'Серіялық Таңдау Әрекеттері',
        'bulk_delete' => 'Жою',
        'cancel' => 'Бас тарту',
        'delete' => 'Жою',
        'detach' => 'Ажырату',
        'deselect' => 'Таңдауды алып тастау',
        'upload' => 'Жүктеу',
        'save' => 'Сақтау',
        'select' => 'Таңдау',
        'add_existing' => 'Бар болып тұрғанды қосу',
        'next' => 'Келесі',
        'previous' => 'Алдыңғы',
        'crop' => 'Кесу',
        'flip_horizontal' => 'Көлденең аудару',
        'flip_vertical' => 'Тігінен аудару',
        'rotate_left' => 'Солға бұру',
        'rotate_right' => 'Оңға бұру',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'Сақтау диски',
            'images' => 'Сурет(тер)',
            'alt_text' => 'Балама мәтін',
            'file_name' => 'Файл атауы',
            'search' => 'Іздеу',
            'width' => 'Ені',
            'height' => 'Биіктігі',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Бұру',
        ],
        'helper_texts' => [
            'alt_text' => 'Қолжетімділік пен SEO жақсарту үшін суретте көрсетілген нәрсенің сипаттамасы.',
        ],
        'placeholders' => [
            'no_image_selected' => 'Ешқандай сурет таңдалмаған.',
            'no_images_selected' => 'Ешқандай сурет таңдалмаған.',
            'no_images_found' => 'Ешқандай сурет табылмады.',
            'search' => 'Файл атауы немесе балама мәтін бойынша іздеу...',
        ],
        'prefixes' => [
            'width' => 'Ені',
            'height' => 'Биіктігі',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Бұру',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'градус',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} :count Суретті жою керек пе?|[2,*] :count Суретті жою керек пе?',
            'delete' => 'Суретті жою',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} Таңдалған суретті жойғыңыз келе ме?|[2,*] Таңдалған :count суретті жойғыңыз келе ме?',
            'delete' => 'Бұл суретті жойғыңыз келе ме?',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'Сурет сәтті жойылды.',
            'failure' => 'Суретті жою сәтсіз аяқталды.',
        ],
        'upload' => [
            'success' => '{1} Сурет сәтті жүктелді.|[2,*] Суреттер сәтті жүктелді.',
            'failure' => '{1} Берілген суретті жүктеу сәтсіз аяқталды.|[2,*] Берілген суреттерді жүктеу сәтсіз аяқталды.',
        ],
        'edit_source_image' => [
            'success' => 'Бастапқы сурет сәтті жаңартылды.',
            'failure' => 'Бастапқы суретті жаңарту сәтсіз аяқталды.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'Ешқандай сурет табылмады',
        ],
        'title' => 'Сурет кітапханасы',
    ],
    'tooltips' => [
        'crop' => 'Кесу',
        'deselect' => 'Таңдауды алып тастау',
        'edit' => 'Өңдеу',
        'delete' => 'Жою',
        'detach' => 'Ажырату',
        'select' => 'Таңдау',
        'drag_handle' => 'Қайта реттеу үшін сүйреңіз',
        'rotate_right' => 'Оңға бұру',
        'rotate_left' => 'Солға бұру',
        'flip_horizontal' => 'Көлденең аудару',
        'flip_vertical' => 'Тігінен аудару',
        'view' => 'Көру',
    ],
];
