<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'Дејства за Избор',
        'bulk_delete' => 'Избриши',
        'cancel' => 'Откажи',
        'delete' => 'Избриши',
        'detach' => 'Одвои',
        'deselect' => 'Одозначи',
        'upload' => 'Прикачи',
        'save' => 'Зачувај',
        'select' => 'Избери',
        'add_existing' => 'Додај Постојни',
        'next' => 'Следен',
        'previous' => 'Претходен',
        'crop' => 'Исечи',
        'flip_horizontal' => 'Преврти Хоризонтално',
        'flip_vertical' => 'Преврти Вертикално',
        'rotate_left' => 'Ротирај Лево',
        'rotate_right' => 'Ротирај Десно',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'Диск за Складирање',
            'images' => 'Слика(и)',
            'alt_text' => 'Алтернативен Текст',
            'file_name' => 'Име на Датотека',
            'search' => 'Пребарај',
            'width' => 'Ширина',
            'height' => 'Висина',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Ротирај',
        ],
        'helper_texts' => [
            'alt_text' => 'Опис на она што е прикажано во сликата за подобра достапност и SEO.',
        ],
        'placeholders' => [
            'no_image_selected' => 'Нема избрана слика.',
            'no_images_selected' => 'Нема избрани слики.',
            'no_images_found' => 'Не се најдени слики.',
            'search' => 'Пребарај по име на датотека или алтернативен текст...',
        ],
        'prefixes' => [
            'width' => 'Ширина',
            'height' => 'Висина',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Ротирај',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'степени',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} Избриши :count Слика?|[2,*] Избриши :count Слики?',
            'delete' => 'Избриши Слика',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} Дали сте сигурни дека сакате да ја избришете избраната слика?|[2,*] Дали сте сигурни дека сакате да ги избришете избраните :count слики?',
            'delete' => 'Дали сте сигурни дека сакате да ја избришете оваа слика?',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'Сликата е успешно избришана.',
            'failure' => 'Неуспешно бришење на сликата.',
        ],
        'upload' => [
            'success' => '{1} Сликата е успешно прикачена.|[2,*] Сликите се успешно прикачени.',
            'failure' => '{1} Неуспешно прикачување на дадената слика.|[2,*] Неуспешно прикачување на дадените слики.',
        ],
        'edit_source_image' => [
            'success' => 'Изворната слика е успешно ажурирана.',
            'failure' => 'Неуспешно ажурирање на изворната слика.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'Не се најдени слики',
        ],
        'title' => 'Библиотека со Слики',
    ],
    'tooltips' => [
        'crop' => 'Исечи',
        'deselect' => 'Одозначи',
        'edit' => 'Уреди',
        'delete' => 'Избриши',
        'detach' => 'Одвои',
        'select' => 'Избери',
        'drag_handle' => 'Влечи за преуредување',
        'rotate_right' => 'Ротирај Десно',
        'rotate_left' => 'Ротирај Лево',
        'flip_horizontal' => 'Преврти Хоризонтално',
        'flip_vertical' => 'Преврти Вертикално',
        'view' => 'Погледни',
    ],
];
