<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'ការកំណត់ការជ្រើសរើស',
        'bulk_delete' => 'លុប',
        'cancel' => 'បោះបង់',
        'delete' => 'លុប',
        'detach' => 'ផ្ដាច់',
        'deselect' => 'មិនជ្រើសរើស',
        'upload' => 'ផ្ទុកឡើង',
        'save' => 'រក្សាទុក',
        'select' => 'ជ្រើសរើស',
        'add_existing' => 'បន្ថែមដែលមាន',
        'next' => 'បន្ទាប់',
        'previous' => 'មុន',
        'crop' => 'កាត់',
        'flip_horizontal' => 'បង្វិលផ្ដេក',
        'flip_vertical' => 'បង្វិលឈរ',
        'rotate_left' => 'បង្វិលឆ្វេង',
        'rotate_right' => 'បង្វិលស្ដាំ',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'ថាសរក្សាទុក',
            'images' => 'រូបភាព',
            'alt_text' => 'អក្សរជម្រើស',
            'file_name' => 'ឈ្មោះឯកសារ',
            'search' => 'ស្វែងរក',
            'width' => 'ទទឹង',
            'height' => 'កម្ពស់',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'បង្វិល',
        ],
        'helper_texts' => [
            'alt_text' => 'ការពិពណ៌នាអំពីអ្វីដែលបង្ហាញក្នុងរូបភាពសម្រាប់ការធ្វើឱ្យប្រសើរជាងការចូលប្រើ និង SEO។',
        ],
        'placeholders' => [
            'no_image_selected' => 'គ្មានរូបភាពត្រូវបានជ្រើសរើសទេ។',
            'no_images_selected' => 'គ្មានរូបភាពត្រូវបានជ្រើសរើសទេ។',
            'no_images_found' => 'រកមិនឃើញរូបភាព។',
            'search' => 'ស្វែងរកតាមឈ្មោះឯកសារ ឬអក្សរជម្រើស...',
        ],
        'prefixes' => [
            'width' => 'ទទឹង',
            'height' => 'កម្ពស់',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'បង្វិល',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'ដឺក្រេ',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} លុបរូបភាព :count?|[2,*] លុបរូបភាព :count?',
            'delete' => 'លុបរូបភាព',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} តើអ្នកប្រាកដថាចង់លុបរូបភាពដែលបានជ្រើសរើសមែនទេ?|[2,*] តើអ្នកប្រាកដថាចង់លុបរូបភាព :count ដែលបានជ្រើសរើសមែនទេ?',
            'delete' => 'តើអ្នកប្រាកដថាចង់លុបរូបភាពនេះមែនទេ?',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'រូបភាពត្រូវបានលុបដោយជោគជ័យ។',
            'failure' => 'បានបរាជ័យក្នុងការលុបរូបភាព។',
        ],
        'upload' => [
            'success' => '{1} រូបភាពត្រូវបានផ្ទុកឡើងដោយជោគជ័យ។|[2,*] រូបភាពត្រូវបានផ្ទុកឡើងដោយជោគជ័យ។',
            'failure' => '{1} បានបរាជ័យក្នុងការផ្ទុកឡើងរូបភាពដែលបានផ្ដល់។|[2,*] បានបរាជ័យក្នុងការផ្ទុកឡើងរូបភាពដែលបានផ្ដល់។',
        ],
        'edit_source_image' => [
            'success' => 'រូបភាពប្រភពត្រូវបានកែប្រែដោយជោគជ័យ។',
            'failure' => 'បានបរាជ័យក្នុងការកែប្រែរូបភាពប្រភព។',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'រកមិនឃើញរូបភាព',
        ],
        'title' => 'បណ្ណាល័យរូបភាព',
    ],
    'tooltips' => [
        'crop' => 'កាត់',
        'deselect' => 'មិនជ្រើសរើស',
        'edit' => 'កែប្រែ',
        'delete' => 'លុប',
        'detach' => 'ផ្ដាច់',
        'select' => 'ជ្រើសរើស',
        'drag_handle' => 'អូសដើម្បីរៀបចំឡើងវិញ',
        'rotate_right' => 'បង្វិលស្ដាំ',
        'rotate_left' => 'បង្វិលឆ្វេង',
        'flip_horizontal' => 'បង្វិលផ្ដេក',
        'flip_vertical' => 'បង្វិលឈរ',
        'view' => 'មើល',
    ],
];
