<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'کردارەکانی هەڵبژاردن',
        'bulk_delete' => 'سڕینەوە',
        'cancel' => 'هەڵوەشاندنەوە',
        'delete' => 'سڕینەوە',
        'detach' => 'جوداکردنەوە',
        'deselect' => 'هەڵبژاردن لابردن',
        'upload' => 'بارکردن',
        'save' => 'پاشەکەوتکردن',
        'select' => 'هەڵبژاردن',
        'add_existing' => 'زیادکردنی ئەوەی هەیە',
        'next' => 'دواتر',
        'previous' => 'پێشتر',
        'crop' => 'بڕین',
        'flip_horizontal' => 'ئاسۆیی وەرگێڕان',
        'flip_vertical' => 'ستوونی وەرگێڕان',
        'rotate_left' => 'بەرەو چەپ سووڕاندن',
        'rotate_right' => 'بەرەو ڕاست سووڕاندن',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'دیسکی هەڵگرتن',
            'images' => 'وێنە',
            'alt_text' => 'دەقی بەدیل',
            'file_name' => 'ناوی فایل',
            'search' => 'گەڕان',
            'width' => 'پانایی',
            'height' => 'بەرزی',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'سووڕاندن',
        ],
        'helper_texts' => [
            'alt_text' => 'وەسفی ئەوەی کە لە وێنەدا پیشان دراوە بۆ باشترکردنی دەستڕاگەیشتن و SEO.',
        ],
        'placeholders' => [
            'no_image_selected' => 'هیچ وێنەیەک هەڵنەبژێردراوە.',
            'no_images_selected' => 'هیچ وێنەیەک هەڵنەبژێردراوە.',
            'no_images_found' => 'هیچ وێنەیەک نەدۆزرایەوە.',
            'search' => 'گەڕان بە ناوی فایل یان دەقی بەدیل...',
        ],
        'prefixes' => [
            'width' => 'پانایی',
            'height' => 'بەرزی',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'سووڕاندن',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'پلە',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} :count وێنە بسڕدرێتەوە؟|[2,*] :count وێنە بسڕدرێتەوە؟',
            'delete' => 'سڕینەوەی وێنە',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} دڵنیایت کە دەتەوێت وێنە هەڵبژێردراوەکە بسڕیتەوە؟|[2,*] دڵنیایت کە دەتەوێت :count وێنە هەڵبژێردراوەکان بسڕیتەوە؟',
            'delete' => 'دڵنیایت کە دەتەوێت ئەم وێنەیە بسڕیتەوە؟',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'وێنەکە بە سەرکەوتوویی سڕایەوە.',
            'failure' => 'سڕینەوەی وێنەکە سەرکەوتوو نەبوو.',
        ],
        'upload' => [
            'success' => '{1} وێنەکە بە سەرکەوتوویی بارکرا.|[2,*] وێنەکان بە سەرکەوتوویی بارکران.',
            'failure' => '{1} بارکردنی وێنە دابینکراوەکە سەرکەوتوو نەبوو.|[2,*] بارکردنی وێنە دابینکراوەکان سەرکەوتوو نەبوو.',
        ],
        'edit_source_image' => [
            'success' => 'وێنەی سەرچاوە بە سەرکەوتوویی نوێکرایەوە.',
            'failure' => 'نوێکردنەوەی وێنەی سەرچاوە سەرکەوتوو نەبوو.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'هیچ وێنەیەک نەدۆزرایەوە',
        ],
        'title' => 'کتێبخانەی وێنە',
    ],
    'tooltips' => [
        'crop' => 'بڕین',
        'deselect' => 'هەڵبژاردن لابردن',
        'edit' => 'دەستکاری',
        'delete' => 'سڕینەوە',
        'detach' => 'جوداکردنەوە',
        'select' => 'هەڵبژاردن',
        'drag_handle' => 'ڕاکێشان بۆ ڕێکخستنەوە',
        'rotate_right' => 'بەرەو ڕاست سووڕاندن',
        'rotate_left' => 'بەرەو چەپ سووڕاندن',
        'flip_horizontal' => 'ئاسۆیی وەرگێڕان',
        'flip_vertical' => 'ستوونی وەرگێڕان',
        'view' => 'بینین',
    ],
];
