<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'Тандоо Аракеттери',
        'bulk_delete' => 'Өчүрүү',
        'cancel' => 'Жокко чыгаруу',
        'delete' => 'Өчүрүү',
        'detach' => 'Ажыратуу',
        'deselect' => 'Тандабоо',
        'upload' => 'Жүктөө',
        'save' => 'Сактоо',
        'select' => 'Тандоо',
        'add_existing' => 'Барды Кошуу',
        'next' => 'Кийинки',
        'previous' => 'Мурунку',
        'crop' => 'Кесүү',
        'flip_horizontal' => 'Горизонталдык Буруу',
        'flip_vertical' => 'Вертикалдык Буруу',
        'rotate_left' => 'Солго Айлантуу',
        'rotate_right' => 'Оңго Айлантуу',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'Сактоо Диски',
            'images' => 'Сүрөт(төр)',
            'alt_text' => 'Альтернативдүү Текст',
            'file_name' => 'Файл Аты',
            'search' => 'Издөө',
            'width' => 'Туурасы',
            'height' => 'Бийиктиги',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Айлантуу',
        ],
        'helper_texts' => [
            'alt_text' => 'Жеткиликтүүлүктү жана SEO жакшыртуу үчүн сүрөттө көрсөтүлгөн нерсенин сыпаттамасы.',
        ],
        'placeholders' => [
            'no_image_selected' => 'Эч бир сүрөт тандалган жок.',
            'no_images_selected' => 'Эч бир сүрөт тандалган жок.',
            'no_images_found' => 'Эч бир сүрөт табылган жок.',
            'search' => 'Файл аты же альтернативдүү текст боюнча издөө...',
        ],
        'prefixes' => [
            'width' => 'Туурасы',
            'height' => 'Бийиктиги',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Айлантуу',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'градус',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} :count Сүрөттү Өчүрүү?|[2,*] :count Сүрөттү Өчүрүү?',
            'delete' => 'Сүрөттү Өчүрүү',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} Тандалган сүрөттү өчүргүңүз келеби?|[2,*] Тандалган :count сүрөттү өчүргүңүз келеби?',
            'delete' => 'Бул сүрөттү өчүргүңүз келеби?',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'Сүрөт ийгиликтүү өчүрүлдү.',
            'failure' => 'Сүрөттү өчүрүү оңунан чыкпады.',
        ],
        'upload' => [
            'success' => '{1} Сүрөт ийгиликтүү жүктөлдү.|[2,*] Сүрөттөр ийгиликтүү жүктөлдү.',
            'failure' => '{1} Берилген сүрөттү жүктөө оңунан чыкпады.|[2,*] Берилген сүрөттөрдү жүктөө оңунан чыкпады.',
        ],
        'edit_source_image' => [
            'success' => 'Баштапкы сүрөт ийгиликтүү жаңырды.',
            'failure' => 'Баштапкы сүрөттү жаңыртуу оңунан чыкпады.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'Эч бир сүрөт табылган жок',
        ],
        'title' => 'Сүрөт Китепканасы',
    ],
    'tooltips' => [
        'crop' => 'Кесүү',
        'deselect' => 'Тандабоо',
        'edit' => 'Оңдоо',
        'delete' => 'Өчүрүү',
        'detach' => 'Ажыратуу',
        'select' => 'Тандоо',
        'drag_handle' => 'Кайра иреттөө үчүн сүйрөңүз',
        'rotate_right' => 'Оңго Айлантуу',
        'rotate_left' => 'Солго Айлантуу',
        'flip_horizontal' => 'Горизонталдык Буруу',
        'flip_vertical' => 'Вертикалдык Буруу',
        'view' => 'Көрүү',
    ],
];
