<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'Ընտրման գործողություններ',
        'bulk_delete' => 'Ջնջել',
        'cancel' => 'Չեղարկել',
        'delete' => 'Ջնջել',
        'detach' => 'Անջատել',
        'deselect' => 'Չընտրել',
        'upload' => 'Ներբեռնել',
        'save' => 'Պահել',
        'select' => 'Ընտրել',
        'add_existing' => 'Ավելացնել գոյություն ունեցողը',
        'next' => 'Հաջորդ',
        'previous' => 'Նախորդ',
        'crop' => 'Կտրել',
        'flip_horizontal' => 'Շրջել հորիզոնական',
        'flip_vertical' => 'Շրջել ուղղահայաց',
        'rotate_left' => 'Պտտել ձախ',
        'rotate_right' => 'Պտտել աջ',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'Պահեստավորման սկավառակ',
            'images' => 'Նկար(ներ)',
            'alt_text' => 'Այլընտրանքային տեքստ',
            'file_name' => 'Ֆայլի անուն',
            'search' => 'Փնտրել',
            'width' => 'Լայնություն',
            'height' => 'Բարձրություն',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Պտտել',
        ],
        'helper_texts' => [
            'alt_text' => 'Նկարում ցուցադրվածի նկարագրությունը հասանելիության և SEO-ի բարելավման համար:',
        ],
        'placeholders' => [
            'no_image_selected' => 'Ոչ մի նկար ընտրված չէ:',
            'no_images_selected' => 'Ոչ մի նկար ընտրված չէ:',
            'no_images_found' => 'Նկարներ չեն գտնվել:',
            'search' => 'Փնտրել ֆայլի անունով կամ այլընտրանքային տեքստով...',
        ],
        'prefixes' => [
            'width' => 'Լայնություն',
            'height' => 'Բարձրություն',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'Պտտել',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'աստիճան',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} Ջնջե՞լ :count նկարը:|[2,*] Ջնջե՞լ :count նկարները:',
            'delete' => 'Ջնջել նկարը',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} Համոզվա՞ծ եք, որ ցանկանում եք ջնջել ընտրված նկարը:|[2,*] Համոզվա՞ծ եք, որ ցանկանում եք ջնջել ընտրված :count նկարները:',
            'delete' => 'Համոզվա՞ծ եք, որ ցանկանում եք ջնջել այս նկարը:',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'Նկարը հաջողությամբ ջնջվեց:',
            'failure' => 'Նկարը ջնջելը ձախողվեց:',
        ],
        'upload' => [
            'success' => '{1} Նկարը հաջողությամբ ներբեռնվեց:|[2,*] Նկարները հաջողությամբ ներբեռնվեցին:',
            'failure' => '{1} Տրամադրված նկարը ներբեռնելը ձախողվեց:|[2,*] Տրամադրված նկարները ներբեռնելը ձախողվեց:',
        ],
        'edit_source_image' => [
            'success' => 'Աղբյուր նկարը հաջողությամբ թարմացվեց:',
            'failure' => 'Աղբյուր նկարը թարմացնելը ձախողվեց:',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'Նկարներ չեն գտնվել',
        ],
        'title' => 'Նկարների գրադարան',
    ],
    'tooltips' => [
        'crop' => 'Կտրել',
        'deselect' => 'Չընտրել',
        'edit' => 'Խմբագրել',
        'delete' => 'Ջնջել',
        'detach' => 'Անջատել',
        'select' => 'Ընտրել',
        'drag_handle' => 'Քաշեք վերակարգելու համար',
        'rotate_right' => 'Պտտել աջ',
        'rotate_left' => 'Պտտել ձախ',
        'flip_horizontal' => 'Շրջել հորիզոնական',
        'flip_vertical' => 'Շրջել ուղղահայաց',
        'view' => 'Դիտել',
    ],
];
