<?php

declare(strict_types=1);

return [
    'actions' => [
        'bulk_selection_actions' => 'არჩევის მოქმედებები',
        'bulk_delete' => 'წაშლა',
        'cancel' => 'გაუქმება',
        'delete' => 'წაშლა',
        'detach' => 'გამოყოფა',
        'deselect' => 'არჩევის გაუქმება',
        'upload' => 'ატვირთვა',
        'save' => 'შენახვა',
        'select' => 'არჩევა',
        'add_existing' => 'არსებულის დამატება',
        'next' => 'შემდეგი',
        'previous' => 'წინა',
        'crop' => 'ამოჭრა',
        'flip_horizontal' => 'ჰორიზონტალური შებრუნება',
        'flip_vertical' => 'ვერტიკალური შებრუნება',
        'rotate_left' => 'მარცხნივ ბრუნვა',
        'rotate_right' => 'მარჯვნივ ბრუნვა',
    ],
    'forms' => [
        'labels' => [
            'disk' => 'საცავი დისკი',
            'images' => 'სურათ(ებ)ი',
            'alt_text' => 'ალტერნატიული ტექსტი',
            'file_name' => 'ფაილის სახელი',
            'search' => 'ძიება',
            'width' => 'სიგანე',
            'height' => 'სიმაღლე',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'ბრუნვა',
        ],
        'helper_texts' => [
            'alt_text' => 'სურათში ნაჩვენების აღწერა მისაწვდომობისა და SEO-ს გაუმჯობესებისთვის.',
        ],
        'placeholders' => [
            'no_image_selected' => 'სურათი არჩეული არ არის.',
            'no_images_selected' => 'სურათები არჩეული არ არის.',
            'no_images_found' => 'სურათები ნაპოვნი არ არის.',
            'search' => 'ძებნა ფაილის სახელით ან ალტერნატიული ტექსტით...',
        ],
        'prefixes' => [
            'width' => 'სიგანე',
            'height' => 'სიმაღლე',
            'x' => 'X',
            'y' => 'Y',
            'rotate' => 'ბრუნვა',
        ],
        'suffixes' => [
            'width' => 'px',
            'height' => 'px',
            'x' => 'px',
            'y' => 'px',
            'rotate' => 'გრადუსი',
        ],
    ],
    'modals' => [
        'headings' => [
            'bulk_delete' => '{1} წაიშალოს :count სურათი?|[2,*] წაიშალოს :count სურათი?',
            'delete' => 'სურათის წაშლა',
        ],
        'descriptions' => [
            'bulk_delete' => '{1} დარწმუნებული ხართ, რომ გსურთ არჩეული სურათის წაშლა?|[2,*] დარწმუნებული ხართ, რომ გსურთ არჩეული :count სურათის წაშლა?',
            'delete' => 'დარწმუნებული ხართ, რომ გსურთ ამ სურათის წაშლა?',
        ],
    ],
    'notifications' => [
        'delete' => [
            'success' => 'სურათი წარმატებით წაიშალა.',
            'failure' => 'სურათის წაშლა ვერ მოხერხდა.',
        ],
        'upload' => [
            'success' => '{1} სურათი წარმატებით აიტვირთა.|[2,*] სურათები წარმატებით აიტვირთა.',
            'failure' => '{1} მოწოდებული სურათის ატვირთვა ვერ მოხერხდა.|[2,*] მოწოდებული სურათების ატვირთვა ვერ მოხერხდა.',
        ],
        'edit_source_image' => [
            'success' => 'საწყისი სურათი წარმატებით განახლდა.',
            'failure' => 'საწყისი სურათის განახლება ვერ მოხერხდა.',
        ],
    ],
    'page' => [
        'empty_state' => [
            'heading' => 'სურათები ნაპოვნი არ არის',
        ],
        'title' => 'სურათების ბიბლიოთეკა',
    ],
    'tooltips' => [
        'crop' => 'ამოჭრა',
        'deselect' => 'არჩევის გაუქმება',
        'edit' => 'რედაქტირება',
        'delete' => 'წაშლა',
        'detach' => 'გამოყოფა',
        'select' => 'არჩევა',
        'drag_handle' => 'გადაათრიეთ ხელახლა დახარისხებისთვის',
        'rotate_right' => 'მარჯვნივ ბრუნვა',
        'rotate_left' => 'მარცხნივ ბრუნვა',
        'flip_horizontal' => 'ჰორიზონტალური შებრუნება',
        'flip_vertical' => 'ვერტიკალური შებრუნება',
        'view' => 'ნახვა',
    ],
];
